ab = [int(input()) for i in range(2)]  # Ввід даних
suma = 0  # Пуста змінна для суми
mulp = 1  # Пуста змінна для обрахунку добутку
while ab[0] < ab[1] + 1:  # Поки A менше ніж B, край діапазону, йде перебір чисел
    if ab[0] % 3 == 0:
        suma += ab[0]  # Обчислюю суму
        mulp *= ab[0]  # Обчилюю добуток
        ab[0] += 3  # Додаю 3, щоб скоротити майбутню роботу цикла
    else:
        ab[0] += 1
print(f"Сума чисел, які діляться на 3: {suma}\nДобуток цих чисел: {mulp}")  # Вивід інформації

