m, n = float(input("m >> ")), float(input("n >> "))  # Ввід даних
exp = "(m**0.5 - (((m*n)**0.5+n)/(m**0.5+n**0.5)))**2*(m**0.5/(m**0.5+n**0.5)+n**0.5/(m**0.5-n**0.5)+2*(m*n)**0.5)/(m-n)"
exp_s = "m-n"
# Вивід аналізу не спрощенного виразу
print(
    "Кінцевий результат (повний):{result}\nКількість '+':{0}\nКількість '-': {1}\nКількість '*': {2}\nКількість '/': "
    "{3}\nКількість '**': {4}\nСума всіх символів:{5} " "".format(
        exp.count("+"), exp.count("-"), exp.count("*") - 2 * exp.count("**"), exp.count("/"), exp.count("**"),
        exp.count("+") + exp.count("-") + exp.count("*") - 2 * exp.count("**") + exp.count("/") + exp.count("**"),
        result=(((m ** 0.5 - ((m * n) ** 0.5 + n) /
                  (m ** 0.5 + n ** 0.5)) ** 2) *
                ((m ** 0.5) / (m ** 0.5 + n ** 0.5) +
                 (n ** 0.5) / (m ** 0.5 - n ** 0.5) +
                 (2 * (m * n) ** 0.5) / (m - n)))))
# Вивід аналізу спрощенного виразу
print(
    "\nКінцевий результат (спрощенний):{result}\nКількість '+':{0}\nКількість '-': {1}\nКількість '*': {2}\nКількість "
    "'/': {3}\nКількість '**': {4}\nСума всіх символів:{5} " "".format(
        exp_s.count("+"), exp_s.count("-"), exp_s.count("*") - 2 * exp_s.count("**"),
        exp_s.count("/"), exp_s.count("**"),
        exp_s.count("+") + exp_s.count("-") + exp_s.count("*") - 2 * exp_s.count(
            "**") + exp_s.count("/") + exp_s.count("**"), result=(m - n)))
