import random

not_Exit = True
choice = None


class Client:
    def __init__(self, name, age, price, experience, health, profession):
        self.name = name
        self.age = age
        self.price = price
        self.experience = experience
        self.health = health
        self.profession = profession


def sleep_calculator(age):
    if age <= 2:
        recommended_sleep = "11-14 годин"
    elif 3 <= age <= 5:
        recommended_sleep = "10-13 годин"
    elif 6 <= age <= 12:
        recommended_sleep = "9-12 годин"
    elif 13 <= age <= 17:
        recommended_sleep = "8-10 годин"
    elif 18 <= age <= 64:
        recommended_sleep = "7-9 годин"
    else:
        recommended_sleep = "7-8 годин"

    print(f"Рекомендована тривалість сну для вашого віку ({age}): {recommended_sleep}")


professions = [
    "лікарем",
    "вчителем",
    "інженером",
    "програмістом",
    "архітектором",
    "юристом",
    "дизайнером",
    "журналістом",
    "електриком",
    "психологом",
    "пілотом",
    "механіком",
    "медсестрою",
    "ветеринаром",
    "офіціантом",
    "барменом",
    "кухарем",
    "фотографом",
    "режисером",
    "актором",
    "співаком",
    "музикантом",
    "художником",
    "скульптором",
    "хіміком",
    "біологом",
    "фізиком",
    "геологом",
    "астрономом",
    "економістом",
    "бухгалтером",
    "маркетологом",
    "соціологом",
    "істориком",
    "філологом",
    "політологом",
    "дипломатом",
    "пожежником",
    "поліцейським",
    "листоношею",
    "тренером",
    "спортсменом",
    "агентом з нерухомості",
    "перекладачем",
    "адвокатом",
    "секретарем",
    "менеджером",
    "аналітиком",
    "логістом",
    "оператором кол-центру",
    "будівельником",
    "малярем",
    "сантехніком",
    "садівником",
    "фермером",
    "пекарем",
    "водієм",
    "логопедом",
    "інструктором з йоги",
    "бортпровідником",
    "оператором на виробництві",
    "продавцем",
    "бібліотекарем",
    "лісником",
    "ландшафтним дизайнером",
    "консультантом",
    "інженером-будівельником",
    "інженером-механіком",
    "хореографом",
    "модельєром",
    "спеціалістом з PR",
    "мікробіологом",
    "фінансовим аналітиком",
    "сценаристом",
    "ілюстратором",
    "гейм-дизайнером",
    "косметологом",
    "стоматологом",
    "лаборантом",
    "офтальмологом",
    "логістиком",
    "інспектором",
    "льотчиком-випробувачем",
    "ріелтором",
    "програмістом-розробником",
    "системним адміністратором",
    "спеціалістом із захисту інформації",
    "картографом",
    "моряком",
    "диспетчером",
    "агрономом",
    "вихователем",
    "швеєю",
    "стилістом",
    "антикваром",
    "археологом",
    "ентомологом",
    "промоутером",
    "оцінювачем",
    "аналітиком даних"
]

names = ["Олексій", "Ірина", "Дмитро", "Катерина", "Владислав", "Марина", "Сергій", "Оксана", "Максим", "Анастасія",
         "Юрій", "Тетяна", "Артем", "Вікторія", "Володимир", "Ольга", "Євген", "Наталія", "Павло", "Алла", "Анна",
         "Влад", "Михайло"]
# частина 1 для мотиваційних фраз
part1 = [
    "Не зупиняйся,",
    "Ти на правильному шляху,",
    "Продовжуй рухатися вперед,",
    "Кожен день ти стаєш кращим,",
    "Твої зусилля не марні,",
    "Ти сильніший, ніж думаєш,",
    "З кожним кроком ти ближче до мети,",
    "Твоя праця приносить плоди,",
    "Кожен новий день — новий шанс,",
    "Не здавайся,",
    "Працюй над собою,",
    "Ти здатний на більше,",
    "Сьогодні — час для дій,",
    "Продовжуй боротися,",
    "Кожна маленька перемога має значення,",
    "Ти можеш подолати будь-які труднощі,",
    "Кожен крок — це успіх,",
    "Не бійся йти вперед,",
    "Вір у свої сили,",
    "Кожен новий виклик робить тебе сильнішим,"
]
# частина 2 для мотиваційних фраз
part2 = [
    "ти вже близько до своєї цілі!",
    "успіх чекає на тебе!",
    "зміни починаються з маленьких кроків.",
    "ти сильніший, ніж вчора.",
    "кожен зусилля робить тебе ближче до мети.",
    "ти робиш неймовірне!",
    "зміни відбуваються, навіть якщо ти їх не бачиш.",
    "успіх — це результат постійних зусиль.",
    "продовжуй діяти, і ти побачиш результат.",
    "ти створюєш своє майбутнє зараз.",
    "з кожним днем ти стаєш на крок ближче до мрії.",
    "ти здатен досягти всього, що захочеш.",
    "кожне випробування робить тебе сильнішим.",
    "все, що тобі потрібно — це вірити в себе.",
    "мрія стане реальністю завдяки твоїм зусиллям.",
    "завдяки твоїй наполегливості, успіх неминучий.",
    "кожен твій крок — це вклад у майбутнє.",
    "успіх приходить до тих, хто не зупиняється.",
    "кожен день ти на крок ближче до перемоги.",
    "все можливо, якщо ти продовжуєш йти вперед."
]


def motivation():
    print(f"<{random.choice(part1)} {random.choice(part2)}>")


def water_intake(weight):
    water_needed = weight * 30
    print(f"\n<Вам потрібно випити {water_needed} мл води на день.>")


def imt(weight, height):
    bmi = weight / ((height / 100) ** 2)
    if bmi < 18.5:
        category = "<Недостатня вага>"
    elif 18.5 <= bmi < 24.9:
        category = "<Норма>"
    elif 25 <= bmi < 29.9:
        category = "<Надмірна вага>"
    else:
        category = "<Ожиріння>"
    print(category)


def heart_rate_zones(age):
    max_heart_rate = 220 - age
    print(f"Максимальна частота серцевих скорочень: {max_heart_rate} уд/хв")
    print(f"Зона спокою (50-60%): {round(max_heart_rate * 0.50, 2)} - {round(max_heart_rate * 0.60, 2)} уд/хв")
    print(f"Зона жироспалювання (60-70%): {round(max_heart_rate * 0.60, 2)} - {round(max_heart_rate * 0.70, 2)} уд/хв")

    print(f"Аеробна зона (80-90%): {round(max_heart_rate * 0.80, 2)} - {round(max_heart_rate * 0.90, 2)} уд/хв")
    print(f"Анаеробна зона (90-95%): {round(max_heart_rate * 0.90, 2)} - {round(max_heart_rate * 0.95, 2)} уд/хв")
    print(f"Червона зона (95-100%): {round(max_heart_rate * 0.95, 2)} - {round(max_heart_rate * 1.00, 2)} уд/хв")


def calories(weight, activity, duration):
    activity_data = {"біг": 0.063,
                     "плавання": 0.050,
                     "їзда на  велосипеді": 0.045,
                     "йога": 0.034,
                     "ходьба": 0.035,
                     "тренажери": 0.055}
    if activity not in activity_data:
        print(f"{activity} немає в списку можливих активностей")
    else:
        print(f"Ви спалили {round(weight * activity_data[activity] * duration, 2)} за {duration} хвилин")


while not_Exit:
    print("<Оберіть пункт меню>\n<1. Потрібна мотивація?>\n"
          "<2. Калькулятор ІМТ >\n"
          "<3. Калькулятор обʼєму води на вагу>\n"
          "<4. Калькулятор ЧСС>\n"
          "<5. Калькулятор спалення калорій >\n"
          "<6. Знайти клієнта>\n"
          "<7. Калькулятор сну>\n"
          "<8. Про програму>\n"
          "<0. Вихід >")
    choice = int(input())

    if choice == 0:
        print("<Допобачення! Дякую, що скористувались послугами програми!👋 >")
        not_Exit = False

    elif choice == 1:
        motivation()

    elif choice == 2:
        imt(float(input("Введіть вашу вагу>>")), float(input("Введість ваш зріст>>")))

    elif choice == 3:
        water_intake(float(input("Введіть вашу вагу>>")))

    elif choice == 4:
        heart_rate_zones(int(input("Введіть ваш вік>>")))

    elif choice == 5:
        calories(float(input("Введіть вашу вагу>>")), input(
            "Можливі активності: \nбіг, плавання, їзда на велосипеді, йога, ходьба, тренажери\nВведіть активність>>"),
                 float(input("Введіть час виконання вправи (в хвилинах) >>")))

    elif choice == 6:
        age = random.randint(25, 70)
        client = Client(random.choice(names), age, random.randint(3000, 50000),
                        random.randint(0, 40) if age > 60 else random.randint(0, 13),
                        random.choice(["здорова", "слабка", "повільна", "товста", "худа"]), random.choice(professions))
        if 11 <= client.experience < 21:
            rokiv = "років"
        else:
            if str(client.experience)[-1] == "1":
                rokiv = "рік"
            elif 2 <= int(str(client.experience)[-1]) < 5:
                rokiv = "роки"
            else:
                rokiv = "років"
            if str(client.age)[-1] == "1":
                rokiv2 = "рік"
            elif 2 <= int(str(client.age)[-1]) < 5:
                rokiv2 = "роки"
            else:
                rokiv2 = "років"
            print(f"{client.name}, {client.health} людина,"
                  f" {client.age} {rokiv2}. Зарплатня: {client.price} і працює "
                  f"{'аж ' + str(client.experience) if client.experience > 10 else client.experience} "
                  f"{rokiv} {client.profession}")

    elif choice == 7:
        sleep_calculator(int(input("Введіть ваш вік>>")))

    elif choice == 8:
        print(
            "Програма написана для творчого завдання з Основ програмування студентом Ковальчук Адам 122 1 курс. "
            "Всі збіги, крім імені студента, який виконував роботу, випадкові! Гарного Вам дня!")
